cases/stefanProblem/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 0.02 0)
    (0 0.02 0)
    (0 0 0.002)
    (1 0 0.002)
    (1 0.02 0.002)
    (0 0.02 0.002)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 1)
    simpleGrading (1 1 1)
);

patches
(
    wall faceWall
    (
      (0 4 7 3)
    )

    patch outlet
    (
      (2 6 5 1)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
	(1 5 4 0)
	(3 7 6 2)
    )   
);

// ************************************************************************* //
